[
  "Manage",
  "Tiefling",
  "Sorcerer",
  "LVL",
  "XP",
  "Share",
  "Short Rest",
  "Long Rest",
  "Ability Scores",
  "Strength",
  "Dexterity",
  "Constitution",
  "Intelligence",
  "Wisdom",
  "Charisma",
  "Proficiency Bonus",
  "Proficiency",
  "Bonus",
  "Speed",
  "Walking",
  "Inspiration",
  "Heroic Inspiration",
  "Character Health",
  "Heal",
  "Damage",
  "Current",
  "Max",
  "Temp",
  "Hit Points",
  "Saving Throws",
  "Saving Throw",
  "str",
  "dex",
  "con",
  "int",
  "wis",
  "cha",
  "Saving Throw Modifiers",
  "Senses",
  "Passive Perception",
  "Passive Investigation",
  "Passive Insight",
  "Darkvision 18 m.",
  "Proficiencies and Languages",
  "Armor",
  "None",
  "Weapons",
  "Crossbow, Light",
  "Dagger",
  "Dart",
  "Quarterstaff",
  "Sling",
  "Tools",
  "Languages",
  "Common",
  "Deep Speech",
  "Draconic",
  "Infernal",
  "Primordial",
  "Proficiencies & Training",
  "Skills",
  "Prof",
  "Modifier",
  "Mod",
  "Skill",
  "DEX",
  "Acrobatics",
  "WIS",
  "Animal Handling",
  "INT",
  "Arcana",
  "STR",
  "Athletics",
  "CHA",
  "Deception",
  "History",
  "Insight",
  "Intimidation",
  "Investigation",
  "Medicine",
  "Nature",
  "Perception",
  "Performance",
  "Persuasion",
  "Religion",
  "Sleight of Hand",
  "Stealth",
  "Survival",
  "Additional Skills",
  "Initiative",
  "Armor Class",
  "Class",
  "Defenses and Conditions",
  "Defenses",
  "Fire",
  "Conditions",
  "Add Active Conditions",
  "Actions",
  "Spells",
  "Inventory",
  "Features & Traits",
  "Background",
  "Notes",
  "Extras",
  "All",
  "Attack",
  "Action",
  "Bonus Action",
  "Reaction",
  "Other",
  "Limited Use",
  "Manage Custom",
  "Actions",
  "Attacks per Action",
  "Range",
  "Hit / DC",
  "Upvote/Downvote",
  "R",
  "Melee Weapon",
  "Simple",
  "Finesse",
  "Light",
  "Thrown",
  "Nick",
  "Range",
  "Shortsword",
  "Reach",
  "Martial",
  "Vex",
  "Chill Touch",
  "Legacy",
  "Cantrip",
  "Sorcerer",
  "D: 1Rnd",
  "V",
  "S",
  "Fire Bolt",
  "Unarmed Strike",
  "Melee Attack",
  "Actions in Combat",
  "Dash",
  "Disengage",
  "Dodge",
  "Grapple",
  "Help",
  "Hide",
  "Improvise",
  "Influence",
  "Magic",
  "Ready",
  "Search",
  "Shove",
  "Study",
  "Utilize",
  "Sorcery Points",
  "You have",
  "sorcery points that you regain when you finish a long rest.",
  "You make a melee attack that involves using your body to deal one of the following effects",
  "Damage.",
  "You make an attack roll against the creature, and on a hit, you deal 1 + STR Bludgeoning damage.",
  "Grapple.",
  "The target must succeed on a Str./Dex. (it chooses which) saving throw (DC = 8 + Prof. Bonus + Str.) or it has the Grappled condition.",
  "Shove.",
  "The target must succeed on a Str./Dex. (it chooses which) saving throw (DC = 8 + Prof. Bonus + Str.) or you can either push it 1.5 m. away or cause it to have the Prone condition.",
  "Bonus Actions",
  "Two-Weapon Fighting",
  "Misty Step",
  "2nd",
  "Legacy",
  "Convert Sorcery Points",
  "You can use your sorcery points to gain additional spell slots or sacrifice spell slots to gain additional sorcery points as a bonus action.",
  "Reactions",
  "Opportunity Attack",
  "Hellish Rebuke",
  "1st",
  "Counterspell",
  "3rd",
  "Interact with an Object",
  "Metamagic - Distant Spell",
  "Special",
  "When you cast a spell that has a range of 1.5 m. or greater, you can spend",
  "sorcery point",
  "to double the range of the spell (or make the range 9 m. for a spell with a range of touch).",
  "Metamagic - Empowered Spell",
  "When you roll damage for a spell, you can spend",
  "to reroll up to",
  "of the dice. You must use the new rolls and you can use this option even if you've already used another Metamagic option.",
  "Left Arrows Icon",
  "Sidebar Overlay Icon",
  "Sidebar Fixed Icon",
  "Sidebar Align Left Icon",
  "Sidebar Align Right Icon",
  "Attributes Icon",
  "Abilities, Saves, Senses",
  "Proficiencies",
  "Training",
  "Skills",
  "Skills Icon",
  "Actions Icon",
  "Equipment Icon",
  "Spells Icon",
  "Features and Traits Icon",
  "Proficiencies Icon",
  "Description Icon",
  "Notes Icon",
  "Extras Icon",
  "Right Arrows Icon",
  "Customize",
  "Action Type",
  "Action",
  "Attack Type",
  "To Hit",
  "Damage",
  "Damage Type",
  "Bludgeoning",
  "Stat",
  "Range/Area",
  "Proficient",
  "Yes",
  "Instead of using a weapon to make a melee attack, you can use a punch, kick, head-butt, or similar forceful blow. In game terms, this is an Unarmed Strike—a melee attack that involves you using your body to damage, grapple, or shove a target within 1.5 meters of you.",
  "Whenever you use your Unarmed Strike, choose one of the following options for its effect.",
  "You make an attack roll against the target. Your bonus to the roll equals your Strength modifier plus your Proficiency Bonus. On a hit, the target takes Bludgeoning damage equal to 1 plus your Strength modifier.",
  "The target must succeed on a Strength or Dexterity saving throw (it chooses which), or it has the Grappled condition. The DC for the saving throw and any escape attempts equals 8 plus your Strength modifier and Proficiency Bonus. This grapple is possible only if the target is no more than one size larger than you and if you have a hand free to grab it.",
  "The target must succeed on a Strength or Dexterity saving throw (it chooses which), or you either push it 1.5 meters away or cause it to have the Prone condition. The DC for the saving throw equals 8 plus your Strength modifier and Proficiency Bonus. This shove is possible only if the target is no more than one size larger than you.",
  "Font of Magic",
  "NaN",
  "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.",
  "You have 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest.",
  "Flexible Casting",
  "You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.",
  "Creating Spell Slots.",
  "You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th.",
  "Any spell slot you create with this feature vanishes when you finish a long rest.",
  "Creating Spell Slots",
  "SPELL SLOT LEVEL",
  "SORCERY POINT COST",
  "4th",
  "5th",
  "Converting a Spell Slot to Sorcery Points.",
  "As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot’s level.",
  "For the rest of the turn, give yourself extra movement equal to your Speed.",
  "When you take the Dash action, you gain extra movement for the current turn. The increase equals your Speed after applying any modifiers. With a Speed of 9 meters, for example, you can move up to 18 meters on your turn if you Dash. If your Speed of 9 meters is reduced to 4.5 meters, you can move up to 9 meters this turn if you Dash.",
  "If you have a special speed, such as a Fly Speed or Swim Speed, you can use that speed instead of your Speed when you take this action. You choose which speed to use each time you take it.",
  "When you take the Attack action on your turn and attack with a Light weapon, you can make one extra attack as a Bonus Action later on the same turn. That extra attack must be made with a different Light weapon, and you don't add your ability modifier to the extra attack's damage unless that modifier is negative. For example, you can attack with a Shortsword in one hand and a Dagger in the other using the Attack action and a Bonus Action, but you don't add your Strength or Dexterity modifier to the damage roll of the Bonus Action unless that modifier is negative.",
  "Bonus Action",
  "Infernal Legacy",
  "Legacy",
  "1st Level",
  "Evocation",
  "Cast",
  "Use",
  "Level",
  "Once per Long Rest",
  "Casting Time",
  "reaction",
  "which you take in response to being damaged by a creature within 60 feet of you that you can see",
  "Components",
  "Duration",
  "Instantaneous",
  "Attack/Save",
  "Source",
  "Player’s Handbook (2014)",
  "You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a Dexterity saving throw. It takes 2d10 fire damage on a failed save, or half as much damage on a successful one.",
  "At Higher Levels.",
  "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.",
  "Tags",
  "3rd Level",
  "Abjuration",
  "Spell Slot",
  "Special",
  "(See Description)",
  "which you take when you see a creature within 60 feet of you casting a spell",
  "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.",
  "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.",
  "Negation",
  "You can interact with one object or feature of the environment for free, during either your move or action. For example, you could open a door during your move as you stride toward a foe.",
  "If you want to interact with a second object, you need to take the Utilize action. Some magic items and other special objects always require an action to use, as stated in their descriptions.",
  "The DM might require you to use an action for any of these activities when it needs special care or when it presents an unusual obstacle. For instance, the DM might require you to take the Utilize action to open a stuck door or turn a crank to lower a drawbridge.",
  "Metamagic",
  "When you cast a spell that has a range of 1.5 meters or greater, you can spend 1 sorcery point to double the range",
  "of the spell.",
  "When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the s",
  "pell 9 meters.",
  "When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use t",
  "he new rolls.",
  "You can use Empowered Spell even if you have already used a different Metamagic option during the casting",
  "All Skills",
  "Custom Skills",
  "Add New Proficiencies",
  "Choose an Option",
  "Weapon",
  "Tool",
  "Language",
  "Darkvision",
  "Passive Checks",
  "A passive check is a special kind of ability check that doesn't involve any die rolls. Such a check can represent the average result for a task done repeatedly, such as searching for secret doors over and over again, or can be used when the DM wants to secretly determine whether the characters succeed at something without rolling dice, such as noticing a hidden monster.",
  "Special senses are described below.",
  "Blindsight",
  "A monster with blindsight can perceive its surroundings without relying on sight, within a specific radius.",
  "Creatures without eyes, such as grimlocks and gray oozes, typically have this special sense, as do creatures with echolocation or heightened senses, such as bats and true dragons.",
  "If a monster is naturally blind, it has a parenthetical note to this effect, indicating that the radius of its blindsight defines the maximum range of its perception.",
  "A monster with darkvision can see in the dark within a specific radius. The monster can see in dim light within the radius as if it were bright light, and in darkness as if it were dim light. The monster can't discern color in darkness, only shades of gray. Many creatures that live underground have this special sense.",
  "Tremorsense",
  "A monster with tremorsense can detect and pinpoint the origin of vibrations within a specific radius, provided that the monster and the source of the vibrations are in contact with the same ground or substance.",
  "Tremorsense can't be used to detect flying or incorporeal creatures. Many burrowing creatures, such as ankhegs, have this special sense.",
  "Truesight",
  "A monster with truesight can, out to a specific range, see in normal and magical darkness, see invisible creatures and objects, automatically detect visual illusions and succeed on saving throws against them, and perceive the original form of a shapechanger or a creature that is transformed by magic. Furthermore, the monster can see into the Ethereal Plane within the same range.",
  "You have no saving throw modifiers",
  "A saving throw — also called a save — represents an attempt to resist a spell, a trap, a poison, a disease, or a similar threat. You don’t normally decide to make a saving throw; you are forced to make one because your character or monster is at risk of harm.",
  "To make a saving throw, roll a d20 and add the appropriate ability modifier. For example, you use your Dexterity modifier for a Dexterity saving throw.",
  "A saving throw can be modified by a situational bonus or penalty and can be affected by advantage and disadvantage, as determined by the DM.",
  "Each class gives proficiency in at least two saving throws. The wizard, for example, is proficient in Intelligence saves. As with skill proficiencies, proficiency in a saving throw lets a character add his or her proficiency bonus to saving throws made using a particular ability score. Some monsters have saving throw proficiencies as well.",
  "The Difficulty Class for a saving throw is determined by the effect that causes it. For example, the DC for a saving throw allowed by a spell is determined by the caster’s spellcasting ability and proficiency bonus.",
  "The result of a successful or failed saving throw is also detailed in the effect that allows the save. Usually, a successful save means that a creature suffers no harm, or reduced harm, from an effect.",
  "Total Score",
  "Base Score",
  "Set Score",
  "Stacking Bonus",
  "Other Modifier",
  "Override Score",
  "Strength measures bodily power, athletic training, and the extent to which you can exert raw physical force.",
  "Strength Checks",
  "A Strength check can model any attempt to lift, push, pull, or break something, to force your body through a space, or to otherwise apply brute force to a situation. The Athletics skill reflects aptitude in certain kinds of Strength checks.",
  "Your Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities",
  "You attempt to climb a sheer or slippery cliff, avoid hazards while scaling a wall, or cling to a surface while something is trying to knock you off.",
  "You try to jump an unusually long distance or pull off a stunt midjump.",
  "You struggle to swim or stay afloat in treacherous currents, storm-tossed waves, or areas of thick seaweed. Or another creature tries to push or pull you underwater or otherwise interfere with your swimming.",
  "Other Strength Checks",
  "The DM might also call for a Strength check when you try to accomplish tasks like the following",
  "Force open a stuck, locked, or barred door",
  "Break free of bonds",
  "Push through a tunnel that is too small",
  "Hang on to a wagon while being dragged behind it",
  "Tip over a statue",
  "Keep a boulder from rolling",
  "Attack Rolls and Damage",
  "You add your Strength modifier to your attack roll and your damage roll when attacking with a melee weapon such as a mace, a battleaxe, or a javelin. You use melee weapons to make melee attacks in hand-to-hand combat, and some of them can be thrown to make a ranged attack.",
  "Lifting and Carrying",
  "Your Strength score determines the amount of weight you can bear. The following terms define what you can lift or carry.",
  "Carrying Capacity.",
  "Your carrying capacity is your Strength score multiplied by 15. This is the weight (in pounds) that you can carry, which is high enough that most characters don't usually have to worry about it.",
  "Push, Drag, or Lift.",
  "You can push, drag, or lift a weight in pounds up to twice your carrying capacity (or 30 times your Strength score). While pushing or dragging weight in excess of your carrying capacity, your speed drops to 1.5 meters.",
  "Size and Strength.",
  "Larger creatures can bear more weight, whereas Tiny creatures can carry less. For each size category above Medium, double the creature's carrying capacity and the amount it can push, drag, or lift. For a Tiny creature, halve these weights.",
  "Variant: Encumbrance",
  "The rules for lifting and carrying are intentionally simple. Here is a variant if you are looking for more detailed rules for determining how a character is hindered by the weight of equipment. When you use this variant, ignore the Strength column of the Armor table in",
  "chapter",
  "If you carry weight in excess of 5 times your Strength score, you are",
  "encumbered",
  "which means your speed drops by 3 meters.",
  "If you carry weight in excess of 10 times your Strength score, up to your maximum carrying capacity, you are instead",
  "heavily encumbered",
  "which means your speed drops by 6 meters and you have disadvantage on ability checks, attack rolls, and saving throws that use Strength, Dexterity, or Constitution.",
  "Dexterity measures agility, reflexes, and balance.",
  "Dexterity Checks",
  "A Dexterity check can model any attempt to move nimbly, quickly, or quietly, or to keep from falling on tricky footing. The Acrobatics, Sleight of Hand, and Stealth skills reflect aptitude in certain kinds of Dexterity checks.",
  "Your Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The DM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.",
  "Whenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The DM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.",
  "Make a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.",
  "Other Dexterity Checks",
  "The DM might call for a Dexterity check when you try to accomplish tasks like the following",
  "Control a heavily laden cart on a steep descent",
  "Steer a chariot around a tight turn",
  "Pick a lock",
  "Disable a trap",
  "Securely tie up a prisoner",
  "Wriggle free of bonds",
  "Play a stringed instrument",
  "Craft a small or detailed object",
  "You add your Dexterity modifier to your attack roll and your damage roll when attacking with a ranged weapon, such as a sling or a longbow. You can also add your Dexterity modifier to your attack roll and your damage roll when attacking with a melee weapon that has the finesse property, such as a dagger or a rapier.",
  "Depending on the armor you wear, you might add some or all of your Dexterity modifier to your Armor Class, as described in chapter 5, \"",
  "Equipment",
  "At the beginning of every combat, you roll initiative by making a Dexterity check. Initiative determines the order of creatures' turns in combat, as described in chapter 9, \"",
  "Combat",
  "HIDING",
  "The DM decides when circumstances are appropriate for hiding. When you try to hide, make a Dexterity (Stealth) check. Until you are discovered or you stop hiding, that check's total is contested by the Wisdom (Perception) check of any creature that actively searches for signs of your presence.",
  "You can't hide from a creature that can see you clearly, and you give away your position if you make noise, such as shouting a warning or knocking over a vase. An invisible creature can always try to hide. Signs of its passage might still be noticed, and it does have to stay quiet.",
  "In combat, most creatures stay alert for signs of danger all around, so if you come out of hiding and approach a creature, it usually sees you. However, under certain circumstances, the DM might allow you to stay hidden as you approach a creature that is distracted, allowing you to gain advantage on an attack roll before you are seen.",
  "Passive Perception.",
  "When you hide, there's a chance someone will notice you even if they aren't searching. To determine whether such a creature notices you, the DM compares your Dexterity (Stealth) check with that creature's passive Wisdom (Perception) score, which equals 10 + the creature's Wisdom modifier, as well as any other bonuses or penalties. If the creature has advantage, add 5. For disadvantage, subtract 5.",
  "For example, if a 1st-level character (with a proficiency bonus of +2) has a Wisdom of 15 (a +2 modifier) and proficiency in Perception, he or she has a passive Wisdom (Perception) of 14.",
  "What Can You See?",
  "One of the main factors in determining whether you can find a hidden creature or object is how well you can see in an area, which might be",
  "lightly",
  "or",
  "heavily obscured",
  "as explained in chapter 8",
  "Adventuring",
  "Constitution measures health, stamina, and vital force.",
  "Constitution Checks",
  "Constitution checks are uncommon, and no skills apply to Constitution checks, because the endurance this ability represents is largely passive rather than involving a specific effort on the part of a character or monster. A Constitution check can model your attempt to push beyond normal limits, however.",
  "The DM might call for a Constitution check when you try to accomplish tasks like the following",
  "Hold your breath",
  "March or labor for hours without rest",
  "Go without sleep",
  "Survive without food or water",
  "Quaff an entire stein of ale in one go",
  "Your Constitution modifier contributes to your hit points. Typically, you add your Constitution modifier to each Hit Die you roll for your hit points.",
  "If your Constitution modifier changes, your hit point maximum changes as well, as though you had the new modifier from 1st level. For example, if you raise your Constitution score when you reach 4th level and your Constitution modifier increases from +1 to +2, you adjust your hit point maximum as though the modifier had always been +2. So you add 3 hit points for your first three levels, and then roll your hit points for 4th level using your new modifier. Or if you're 7th level and some effect lowers your Constitution score so as to reduce your Constitution modifier by 1, your hit point maximum is reduced by 7.",
  "Intelligence measures mental acuity, accuracy of recall, and the ability to reason.",
  "Intelligence Checks",
  "An Intelligence check comes into play when you need to draw on logic, education, memory, or deductive reasoning. The Arcana, History, Investigation, Nature, and Religion skills reflect aptitude in certain kinds of Intelligence checks.",
  "Your Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.",
  "Your Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.",
  "When you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.",
  "Your Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.",
  "Your Intelligence (Religion) check measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.",
  "Other Intelligence Checks",
  "The DM might call for an Intelligence check when you try to accomplish tasks like the following",
  "Communicate with a creature without using words",
  "Estimate the value of a precious item",
  "Pull together a disguise to pass as a city guard",
  "Forge a document",
  "Recall lore about a craft or trade",
  "Win a game of skill",
  "Spellcasting Ability",
  "Wizards use Intelligence as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
  "Wisdom reflects how attuned you are to the world around you and represents perceptiveness and intuition.",
  "Wisdom Checks",
  "A Wisdom check might reflect an effort to read body language, understand someone’s feelings, notice things about the environment, or care for an injured person. The Animal Handling, Insight, Medicine, Perception, and Survival skills reflect aptitude in certain kinds of Wisdom checks.",
  "When there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal’s intentions, the DM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.",
  "Your Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone’s next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.",
  "A Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.",
  "Your Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.",
  "FINDING A HIDDEN OBJECT",
  "When your character searches for a hidden object such as a secret door or a trap, the DM typically asks you to make a Wisdom (Perception) check. Such a check can be used to find hidden details or other information and clues that you might otherwise overlook.",
  "In most cases, you need to describe where you are looking in order for the DM to determine your chance of success. For example, a key is hidden beneath a set of folded clothes in the top drawer of a bureau. If you tell the DM that you pace around the room, looking at the walls and furniture for clues, you have no chance of finding the key, regardless of your Wisdom (Perception) check result. You would have to specify that you were opening the drawers or searching the bureau in order to have any chance of success.",
  "The DM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.",
  "Other Wisdom Checks",
  "The DM might call for a Wisdom check when you try to accomplish tasks like the following",
  "Get a gut feeling about what course of action to follow",
  "Discern whether a seemingly dead or living creature is undead",
  "Clerics, druids, and rangers use Wisdom as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
  "Charisma measures your ability to interact effectively with others. It includes such factors as confidence and eloquence, and it can represent a charming or commanding personality.",
  "Charisma Checks",
  "A Charisma check might arise when you try to influence or entertain others, when you try to make an impression or tell a convincing lie, or when you are navigating a tricky social situation. The Deception, Intimidation, Performance, and Persuasion skills reflect aptitude in certain kinds of Charisma checks.",
  "Your Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.",
  "When you attempt to influence someone through overt threats, hostile actions, and physical violence, the DM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.",
  "Your Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.",
  "When you attempt to influence someone or a group of people with tact, social graces, or good nature, the DM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk.",
  "Other Charisma Checks",
  "The DM might call for a Charisma check when you try to accomplish tasks like the following",
  "Find the best person to talk to for news, rumors, and gossip",
  "Blend into a crowd to get the sense of key topics of conversation",
  "Bards, paladins, sorcerers, and warlocks use Charisma as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
  "Characters have a proficiency bonus determined by level, as detailed in",
  "chapter",
  "Monsters also have this bonus, which is incorporated in their stat blocks. The bonus is used in the rules on ability checks, saving throws, and attack rolls.",
  "Your proficiency bonus can’t be added to a single die roll or other number more than once. For example, if two different rules say you can add your proficiency bonus to a Wisdom saving throw, you nevertheless add the bonus only once when you make the save.",
  "Occasionally, your proficiency bonus might be multiplied or divided (doubled or halved, for example) before you apply it. For example, the rogue’s Expertise feature doubles the proficiency bonus for certain ability checks. If a circumstance suggests that your proficiency bonus applies more than once to the same roll, you still add it only once and multiply or divide it only once.",
  "By the same token, if a feature or effect allows you to multiply your proficiency bonus when making an ability check that wouldn’t normally benefit from your proficiency bonus, you still don’t add the bonus to the check. For that check your proficiency bonus is 0, given the fact that multiplying 0 by any number is still 0. For instance, if you lack proficiency in the History skill, you gain no benefit from a feature that lets you double your proficiency bonus when you make Intelligence (History) checks.",
  "In general, you don’t multiply your proficiency bonus for attack rolls or saving throws. If a feature or effect allows you to do so, these same rules apply.",
  "Initiative scores can replace rolls at your DM's discretion. Your initiative score equals",
  "plus your DEX modifier",
  "Initiative Score",
  "With Advantage",
  "With Disadvantage",
  "Initiative determines the order of turns during combat. When combat starts, every participant rolls Initiative; they make a Dexterity check that determines their place in the Initiative order. The DM rolls for monsters.",
  "Surprise.",
  "If a combatant is surprised by combat starting, that combatant has Disadvantage on their Initiative roll. For example, if an ambusher starts combat while hidden from a foe who is unaware that combat is starting, that foe is surprised.",
  "Initiative Order.",
  "A combatant’s check total is called their Initiative count, or Initiative for short. The DM ranks the combatants, from highest to lowest Initiative. This is the order in which they act during each round. The Initiative order remains the same from round to round.",
  "Ties",
  "If a tie occurs, the DM decides the order among tied monsters, and the players decide the order among tied characters. The DM decides the order if the tie is between a monster and a player character.",
  "Sometimes a DM might have combatants use their Initiative scores instead of rolling Initiative. Your Initiative score equals 10 plus your Dexterity modifier. If you have Advantage on Initiative rolls, increase your Initiative score by 5. If you have Disadvantage on those rolls, decrease that score by 5.",
  "Armor Class",
  "Dexterity Bonus",
  "Unarmored Bonus",
  "Draconic Resilience",
  "Your Armor Class (AC) represents how well your character avoids being wounded in battle. Things that contribute to your AC include the armor you wear, the shield you carry, and your Dexterity modifier. Not all characters wear armor or carry shields, however. \n\nWithout armor or a shield, your character’s AC equals 10 + his or her Dexterity modifier. If your character wears armor, carries a shield, or both, calculate your AC using the rules in the Equipment section. Record your AC on your character sheet.",
  "Every character has a speed, which is the distance in feet that the character can walk in 1 round. This number assumes short bursts of energetic movement in the midst of a life-threatening situation.",
  "While climbing or swimming, each foot of movement costs 1 extra foot (2 extra feet in difficult terrain), unless a creature has a climbing or swimming speed. At the DM’s option, climbing a slippery vertical surface or one with few handholds requires a successful Strength",
  "Similarly, gaining any distance in rough water might require a successful Strength",
  "Your Strength determines how far you can jump.",
  "Long Jump.",
  "check",
  "When you make a long jump, you cover a number of feet up to your Strength score if you move at least 3 meters on foot immediately before the jump. When you make a standing long jump, you can leap only half that distance. Either way, each foot you clear on the jump costs a foot of movement.",
  "This rule assumes that the height of your jump doesn't matter, such as a jump across a stream or chasm. At your DM's option, you must succeed on a DC 10 Strength (Athletics) check to clear a low obstacle (no taller than a quarter of the jump's distance), such as a hedge or low wall. Otherwise, you hit it.",
  "When you land in difficult terrain, you must succeed on a DC 10 Dexterity (Acrobatics) check to land on your feet. Otherwise, you land prone.",
  "High Jump.",
  "When you make a high jump, you leap into the air a number of feet equal to 3 + your Strength modifier (minimum of 0 meters) if you move at least 3 meters on foot immediately before the jump. When you make a standing high jump, you can jump only half that distance. Either way, each foot you clear on the jump costs a foot of movement. In some circumstances, your DM might allow you to make a Strength (Athletics) check to jump higher than you normally can.",
  "You can extend your arms half your height above yourself during the jump. Thus, you can reach above you a distance equal to the height of the jump plus 1 1/2 times your height.",
  "Sometimes the DM or a rule gives you Heroic Inspiration. If you have Heroic Inspiration, you can expend it to reroll any die immediately after rolling it, and you must use the new roll.",
  "Only One at a Time.",
  "You can never have more than one instance of Heroic Inspiration. If something gives you Heroic Inspiration and you already have it, you can give it to a player character in your group who lacks it.",
  "Gaining Heroic Inspiration.",
  "Your DM can give you Heroic Inspiration for a variety of reasons. Typically, DMs award it when you do something particularly heroic, in character, or entertaining. It's a reward for making the game more fun for everyone playing.",
  "Other rules might allow your character to gain Heroic Inspiration independent of the DM's decision. For example, Human characters start each day with Heroic Inspiration.",
  "Resistances",
  "Hellish Resistance",
  "Resistance",
  "Immunity",
  "Vulnerability",
  "Blinded",
  "Charmed",
  "Deafened",
  "Frightened",
  "Grappled",
  "Incapacitated",
  "Invisible",
  "Paralyzed",
  "Petrified",
  "Poisoned",
  "Prone",
  "Restrained",
  "Stunned",
  "Unconscious",
  "Exhaustion",
  "HP Management",
  "Current HP",
  "Max HP",
  "Temp HP",
  "Healing",
  "New HP",
  "Max HP Modifier",
  "Override Max HP",
  "Wisdom (Survival) allows you to follow tracks, forage, find a trail, or avoid natural hazards.",
  "Dexterity (Stealth) allows you to escape notice by moving quietly and hiding behind things.",
  "Dexterity (Sleight of Hand) allows you to pick a pocket, conceal a handheld object, or perform legerdemain.",
  "Intelligence (Religion) allows you to recall lore about gods, religious rituals, and holy symbols.",
  "Charisma (Persuasion) allows you to honestly and graciously convince someone of something.",
  "Charisma (Performance) allows you to act, tell a story, perform music, or dance.",
  "Wisdom (Perception) allows you to use a combination of senses to notice something that’s easy to miss.",
  "Intelligence (Nature) allows you to recall lore about terrain, plants, animals, and weather.",
  "Wisdom (Medicine) allows you to diagnose an illness, or determine what killed the recently slain.",
  "Intelligence (Investigation) allows you to find obscure information in books, or deduce how something works.",
  "Charisma (Intimidation) allows you to awe or threaten someone into doing what you want.",
  "Wisdom (Insight) allows you to discern a person’s mood and intentions.",
  "Intelligence (History) allows you to recall lore about historical events, people, nations, and cultures.",
  "Charisma (Deception) allows you to tell a convincing lie, or wear a disguise convincingly.",
  "Strength (Athletics) allows you to jump farther than normal, stay afloat in rough water, or break something.",
  "Intelligence (Arcana) allows you to recall lore about spells, magic items, and the planes of existence.",
  "Wisdom (Animal Handling) allows you to calm or train an animal, or get an animal to behave in a certain way.",
  "Dexterity (Acrobatics) allows you to stay on your feet in a tricky situation, or perform an acrobatic stunt.",
  "2nd Level",
  "Conjuration",
  "bonus action",
  "Self",
  "Briefly surrounded by silvery mist, you teleport up to 9 meters to an unoccupied space that you can see.",
  "Teleportation",
  "You can make an Opportunity Attack when a creature that you can see leaves your reach using its action, its Bonus Action, its Reaction, or one of its speeds. To make the Opportunity Attack, take a Reaction to make one melee attack with a weapon or an Unarmed Strike against the provoking creature. The attack occurs right before the creature leaves your reach.",
  "Avoiding Opportunity Attack.",
  "You can avoid provoking an Opportunity Attack by taking the Disengage action. You also don't provoke an Opportunity Attack when you Teleport or when you are moved without using your movement, action, Bonus Action, or Reaction. For example, you don't provoke an Opportunity Attack if an explosion hurls you out of a foe's reach or if you fall past an enemy.",
  "Common",
  "In Equipment",
  "Melee",
  "Reach",
  "Range",
  "Piercing",
  "Weight",
  "Cost",
  "2 gp",
  "Properties",
  "Finesse",
  "Light",
  "Thrown",
  "D&D Free Rules (2024)",
  "Proficiency with a Dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
  "This weapon has the following mastery property. To use this property, you must have a feature that lets you use it.",
  "Nick",
  "When you make the extra attack of the Light property, you can make it as part of the Attack action instead of as a Bonus Action. You can make this extra attack only once per turn.",
  "Unequip",
  "Move",
  "Delete",
  "10 gp",
  "Finesse, Light, Vex",
  "Proficiency with a Shortsword allows you to add your proficiency bonus to the attack roll for any attack you make with it.",
  "Vex.",
  "If you hit a creature with this weapon and deal damage to the creature, you have Advantage on your next attack roll against that creature before the end of your next turn.",
  "Necromancy",
  "At Will",
  "action",
  "round",
  "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.",
  "If you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.",
  "This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
  "You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn't being worn or carried.",
  "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
  "The target must succeed on a Strength or Dexterity saving throw (it chooses which), or you either push it 5 feet away or cause it to have the Prone condition. The DC for the saving throw equals 8 plus your Strength modifier and Proficiency Bonus. This shove is possible only if the target is no more than one size larger than you.",
  "Darkness",
  "M",
  "bat fur and a drop of pitch or piece of coal",
  "Concentration, up to 10 minutes",
  "Magical darkness spreads from a point you choose within range to fill a 4.5-meters-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it.",
  "If the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.",
  "If any of this spell's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
  "Control",
  "Spell Attack",
  "Save DC",
  "Manage Spells",
  "Name",
  "Time",
  "Effect",
  "1A",
  "Message",
  "Communication",
  "Prestidigitation",
  "Utility",
  "Thaumaturgy",
  "True Strike",
  "Foreknowledge",
  "Slots",
  "Comprehend Languages",
  "Social",
  "False Life",
  "1/LR",
  "Detect Thoughts",
  "st",
  "1R",
  "1BA",
  "Special: (See Description)",
  "Melf's Minute Meteors",
  "Spell Slots",
  "Add Spells",
  "Known Spells",
  "Loading",
  "Cantrips",
  "Known Spells",
  "Filter",
  "Filter By Spell Level",
  "nd",
  "rd",
  "Filter By Source Category",
  "Core Rules",
  "Expanded Rules",
  "2014 Core Rules",
  "Critical Role",
  "Looking for something not in the list below? Unlock all official options in the",
  "Marketplace",
  "Acid Splash",
  "Learn",
  "Control Flames",
  "Create Bonfire",
  "Dancing Lights",
  "Frostbite",
  "Gust",
  "Mage Hand",
  "Mending",
  "Minor Illusion",
  "Mold Earth",
  "Poison Spray",
  "Ray of Frost",
  "Shape Water",
  "Shocking Grasp",
  "Sorcerous Burst",
  "Thunderclap",
  "Absorb Elements",
  "Burning Hands",
  "Catapult",
  "Charm Person",
  "Chromatic Orb",
  "Color Spray",
  "Detect Magic",
  "Disguise Self",
  "Earth Tremor",
  "Expeditious Retreat",
  "Feather Fall",
  "Fog Cloud",
  "Grease",
  "Ice Knife",
  "Jump",
  "Mage Armor",
  "Magic Missile",
  "Ray of Sickness",
  "Shield",
  "Silent Image",
  "Sleep",
  "Thunderwave",
  "Aganazzar's Scorcher",
  "Alter Self",
  "Blindness/Deafness",
  "Blur",
  "Dragon's Breath",
  "Dust Devil",
  "Earthbind",
  "Enhance Ability",
  "Enlarge/Reduce",
  "Flame Blade",
  "Flaming Sphere",
  "Gust of Wind",
  "Hold Person",
  "Invisibility",
  "Knock",
  "Levitate",
  "Magic Weapon",
  "Maximilian's Earthen Grasp",
  "Mirror Image",
  "Pyrotechnics",
  "Scorching Ray",
  "See Invisibility",
  "Shatter",
  "Snilloc's Snowball Swarm",
  "Spider Climb",
  "Suggestion",
  "Warding Wind",
  "Web",
  "Blink",
  "Clairvoyance",
  "Daylight",
  "Dispel Magic",
  "Erupting Earth",
  "Fear",
  "Fireball",
  "Flame Arrows",
  "Fly",
  "Freedom of the Waves",
  "Gaseous Form",
  "Haste",
  "Hypnotic Pattern",
  "Lightning Bolt",
  "Major Image",
  "Protection from Energy",
  "Sleet Storm",
  "Slow",
  "Stinking Cloud",
  "Tidal Wave",
  "Tongues",
  "Vampiric Touch",
  "Wall of Water",
  "Water Breathing",
  "Water Walk",
  "Transmutation",
  "a short piece of copper wire",
  "You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.",
  "You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 0.3 meters of stone, 2.5 centimeters of common metal, a thin sheet of lead, or 0.9 meters of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.",
  "hour",
  "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range",
  "You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.",
  "You instantaneously light or snuff out a candle, a torch, or a small campfire.",
  "You instantaneously clean or soil an object no larger than 0.03 cubic meters.",
  "You chill, warm, or flavor up to 0.03 cubic meters of nonliving material for 1 hour.",
  "You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.",
  "You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.",
  "If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
  "minute",
  "You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range",
  "Your voice booms up to three times as loud as normal for 1 minute.",
  "You cause flames to flicker, brighten, dim, or change color for 1 minute.",
  "You cause harmless tremors in the ground for 1 minute.",
  "You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.",
  "You instantaneously cause an unlocked door or window to fly open or slam shut.",
  "You alter the appearance of your eyes for 1 minute.",
  "If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.",
  "Divination",
  "Concentration, up to 1 round",
  "You point a finger at a target in range. Your magic grants you a brief insight into the target's defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn't ended.",
  "a pinch of soot and salt",
  "For the duration, you understand the literal meaning of any spoken language that you hear. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text.",
  "This spell doesn't decode secret messages in a text or a glyph, such as an arcane sigil, that isn't part of a written language.",
  "Regain",
  "Temp Hit Points",
  "a small amount of alcohol or distilled spirits",
  "Bolstering yourself with a necromantic facsimile of life, you gain 1d4 + 4 temporary hit points for the duration.",
  "When you cast this spell using a spell slot of 2nd level or higher, you gain 5 additional temporary hit points for each slot level above 1st.",
  "Buff",
  "a copper piece",
  "Concentration, up to 1 minute",
  "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 9 meters of you. If the creature you choose has an Intelligence of 3 or lower or doesn’t speak any language, the creature is unaffected.",
  "You initially learn the surface thoughts of the creature—what is most on its mind in that moment. As an action, you can either shift your attention to another creature’s thoughts or attempt to probe deeper into the same creature’s mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature’s thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends.",
  "Questions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation.",
  "You can also use this spell to detect the presence of thinking creatures you can’t see. When you cast the spell or as your action during the duration, you can search for thoughts within 9 meters of you. The spell can penetrate barriers, but 0.6 meters of rock, 5 centimeters of any metal other than lead, or a thin sheet of lead blocks you. You can’t detect a creature with an Intelligence of 3 or lower or one that doesn’t speak any language.",
  "Once you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can’t see it, but it must still be within range.",
  "Detection",
  "Meteors",
  "niter, sulfur, and pine tar formed into a bead",
  "Elemental Evil Player's Companion",
  "You create six tiny meteors in your space. They float in the air and orbit you for the spell’s duration. When you cast the spell — and as a bonus action on each of your turns thereafter — you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 36 meters of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 1.5 meters of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.",
  "When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd.",
  "Weight Carried",
  "Unencumbered",
  "Manage Inventory",
  "Backpack",
  "Attunement",
  "Other Possessions",
  "Active",
  "Weight",
  "Qty",
  "Cost (gp)",
  "Clothes, Common",
  "Gear",
  "Adventuring Gear",
  "Outerwear",
  "Orb",
  "Arcane Focus",
  "Add Equipment",
  "Hide Contents",
  "Rations (1 day)",
  "Consumable",
  "Waterskin",
  "Container",
  "Add items to your Backpack",
  "Attuned Items",
  "Choose an Item from",
  "the Right",
  "Items Requiring Attunement",
  "Items that you can attune to will display here as you make them active.",
  "a silver coin",
  "Features and Traits",
  "Class Features",
  "Species Traits",
  "Feats",
  "Features",
  "PHB",
  "Proficiencies",
  "Spellcasting",
  "You can cast known sorcerer spells using CHA as your spellcasting modifier (Spell DC",
  "Spell Attack",
  "You can use an arcane focus as a spellcasting focus.",
  "Sorcerous Origin",
  "Draconic Bloodline",
  "Dragon Ancestor",
  "You have a specific dragon type as your ancestor. You can speak, read, and write Draconic and you double your proficiency bonus for CHA checks involving dragons.",
  "Red Dragon",
  "Your max HP increases by",
  "When you aren’t wearing armor, your AC equals",
  "sorcery points that you regain when you finish a long rest. You can use your sorcery points to gain additional spell slots or sacrifice spell slots to gain additional sorcery points as a bonus action.",
  "Uses",
  "You gain the ability to twist spells to suit your needs.",
  "Distant Spell",
  "(No Action)",
  "Empowered Spell",
  "Ability Score Improvement",
  "Charisma Score",
  "BR",
  "You can see in darkness (shades of gray) up to 18 m.",
  "You have resistance to fire damage.",
  "You know the thaumaturgy cantrip. [3rd] You can cast hellish rebuke (2nd) once per long rest. [5th] You can cast darkness once per long rest. CHA is your spellcasting ability.",
  "You have no feats chosen, you can add feats outside of normal progression in the manage screen.",
  "Hit Dice",
  "per sorcerer level",
  "Hit Points at 1st Level",
  "your Constitution modifier",
  "Hit Points at Higher Levels",
  "your Constitution modifier per sorcerer level after 1st",
  "Armor",
  "Weapons",
  "Daggers, darts, slings, quarterstaffs, light crossbows",
  "Tools",
  "Saving Throws",
  "Constitution",
  "Charisma",
  "Skills",
  "Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion",
  "Options",
  "Choose a Sorcerer Skill",
  "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. See",
  "Spells Rules",
  "for the general rules of spellcasting and the",
  "Spells Listing",
  "for the sorcerer spell list.",
  "Cantrips",
  "At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table.",
  "The Sorcerer table shows how many spell slots you have to cast your sorcerer spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
  "For example, if you know the 1st-level spell",
  "burning hands",
  "and have a 1st-level and a 2nd-level spell slot available, you can cast",
  "using either slot.",
  "Spells Known of 1st Level and Higher",
  "You know two 1st-level spells of your choice from the sorcerer spell list.",
  "The Spells Known column of the Sorcerer table shows when you learn more sorcerer spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.",
  "Additionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots.",
  "Charisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.",
  "Spell save DC",
  "your proficiency bonus + your Charisma modifier",
  "Spell attack modifier",
  "your proficiency bonus + your Charisma modifier",
  "Spellcasting Focus",
  "You can use an arcane focus (see the",
  "section) as a spellcasting focus for your sorcerer spells.",
  "Choose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline, detailed at the end of the class description, or one from another source.",
  "Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
  "Option",
  "Choose an Option",
  "Show Details",
  "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later.",
  "Draconic Ancestry",
  "Dragon",
  "Damage Type",
  "Black",
  "Acid",
  "Blue",
  "Lightning",
  "Brass",
  "Bronze",
  "Copper",
  "Gold",
  "Green",
  "Poison",
  "Red",
  "Silver",
  "Cold",
  "White",
  "You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check.",
  "Black Dragon",
  "Blue Dragon",
  "Brass Dragon",
  "Bronze Dragon",
  "Copper Dragon",
  "Gold Dragon",
  "Green Dragon",
  "Silver Dragon",
  "White Dragon",
  "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.",
  "Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your AC equals 13 + your Dexterity modifier.",
  "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.",
  "You can use only one Metamagic option on a spell when you cast it, unless otherwise noted.",
  "Choose a Level 3 Option",
  "Careful Spell",
  "Extended Spell",
  "Heightened Spell",
  "Quickened Spell",
  "Subtle Spell",
  "Twinned Spell",
  "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
  "Using the optional feats rule, you can forgo taking this feature to take a feat of your choice instead.",
  "Feat",
  "Choose an Ability Score",
  "Constitution Score",
  "Dexterity Score",
  "Intelligence Score",
  "Strength Score",
  "Wisdom Score",
  "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 18 meters of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.",
  "You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.",
  "Settings",
  "Add",
  "Alert",
  "Magic Initiate (Cleric)",
  "Magic Initiate (Druid)",
  "Magic Initiate (Wizard)",
  "Savage Attacker",
  "Skilled",
  "Firearm Specialist",
  "Unavailable Feats",
  "Prerequisites Not Met",
  "Archery",
  "Missing",
  "Blood Hunter Fighting Style (Level 2) or College of Swords Fighting Style (Level 3) or Fighter Fighting Style (Level 1) or Fighter Fighting Style (Level 1) or Paladin Fighting Style (Level 2) or Paladin Fighting Style (Level 2) or Ranger Fighting Style (Level 2) or Ranger Fighting Style (Level 2)",
  "Boon of Combat Prowess",
  "19th Level",
  "Boon of Dimensional Travel",
  "Boon of Fate",
  "Boon of Irresistible Offense",
  "Boon of Truesight",
  "Boon of the Night Spirit",
  "Defense",
  "Great Weapon Fighting",
  "Svirfneblin Magic",
  "Deep Gnome (Legacy)",
  "You are adept at using guns effectively.",
  "You gain proficiency with Firearms.",
  "If you roll a misfire on an attack with a firearm, you can use your reaction to roll a d20. If the number rolled is higher than the weapon’s misfire score, the firearm does not misfire. You cannot use this feature of this feat again until you complete a short or long rest.",
  "When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a loaded firearm with the light property you are holding.",
  "THIS IS UNOFFICIAL MATERIAL",
  "These game mechanics are usable in your campaign if your DM allows them but not refined by final game design and editing. They aren’t officially part of the Dungeons & Dragons game and aren’t permitted in D&D Adventurers League events unless otherwise stated. To use this content, toggle the Critical Role content on in the character builder.",
  "Origin Feat",
  "You gain proficiency in any combination of three skills or tools of your choice.",
  "Repeatable.",
  "You can take this feat more than once.",
  "You’ve trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon’s damage dice twice and use either roll against the target.",
  "You gain the following benefits.",
  "Two Cantrips",
  "You learn two cantrips of your choice from the Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat’s spells (choose when you select this feat).",
  "Level 1 Spell",
  "Choose a level 1 spell from the same list you selected for this feat’s cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.",
  "Spell Change",
  "Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list.",
  "You can take this feat more than once, but you must choose a different spell list each time.",
  "You learn two cantrips of your choice from the Druid spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat’s spells (choose when you select this feat).",
  "You learn two cantrips of your choice from the Cleric spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat’s spells (choose when you select this feat).",
  "Initiative Proficiency.",
  "When you roll Initiative, you can add your Proficiency Bonus to the roll.",
  "Initiative Swap.",
  "Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can’t make this swap if you or the ally has the Incapacitated condition.",
  "General Feat (Prerequisite: Level 4+)",
  "Increase one ability score of your choice by 2, or increase two ability scores of your choice by 1. This feat can’t increase an ability score above 20.",
  "Description",
  "Characteristics",
  "Appearance",
  "Haunted One",
  "Feature: Heart of Darkness",
  "Those who look into your eyes can see that you have faced unimaginable horror and that you are no stranger to darkness. Though they might fear you, commoners will extend you every courtesy and do their utmost to help you. Unless you have shown yourself to be a danger to them, they will even take up arms to fight alongside you, should you find yourself facing an enemy alone.",
  "Alignment",
  "Lawful Evil",
  "Gender",
  "Eyes",
  "Size",
  "Medium",
  "Height",
  "Faith",
  "Set, the God of Darkness",
  "Hair",
  "Skin",
  "Age",
  "Personality Traits",
  "Add Personality Traits",
  "Ideals",
  "Add Ideals",
  "Bonds",
  "Add Bonds",
  "Flaws",
  "Add Flaws",
  "Add Appearance information",
  "You are haunted by something so terrible that you dare not speak of it. You’ve tried to bury it and run away from it, to no avail. Whatever this thing is that haunts you can’t be slain with a sword or banished with a spell. It might come to you as a shadow on the wall, a bloodcurdling nightmare, a memory that refuses to die, or a demonic whisper in the dark. The burden has taken its toll, isolating you from most people and making you question your sanity. You must find a way to overcome it before it destroys you.",
  "Skill Proficiencies",
  "Choose two from among Arcana, Investigation, Religion, or Survival",
  "Languages",
  "Choose two, one of which must be Abyssal, Celestial, Deep Speech, Draconic, Infernal, Primordial, Sylvan, or Undercommon",
  "Equipment",
  "A monster hunter’s pack (containing a chest, a crowbar, a hammer, three wooden stakes, a holy symbol, a flask of holy water, a  set of manacles, a steel mirror, a flask of oil, a tinderbox, and 3  torches), one trinket of special significance (choose one or roll on the Horror Trinkets table after this background), a set of common clothes, and 1 sp.",
  "Harrowing Event",
  "Prior to becoming an adventurer, your path in life was defined by one dark moment, one fateful decision, or one tragedy. Now you feel a darkness threatening to consume you, and you fear there may be no hope of escape. Choose a harrowing event that haunts you, or roll one on the Harrowing Events table.",
  "Event",
  "A monster that slaughtered dozens of innocent people spared your life, and you don’t know why.",
  "You were born under a dark star. You can feel it watching you, coldly and distantly. Sometimes it beckons you in the dead of night.",
  "An apparition that has haunted your family for generations now haunts you. You don’t know what it wants, and it won’t leave you alone.",
  "Your family has a history of practicing the dark arts. You dabbled once and felt something horrible clutch at your soul, whereupon you fled in terror.",
  "An oni took your sibling one cold, dark night, and you were unable to stop it.",
  "You were cursed with lycanthropy and later cured. You are now haunted by the innocents you slaughtered.",
  "A hag kidnapped and raised you. You escaped, but the hag still has a magical hold over you and fills your mind with evil thoughts.",
  "You opened an eldritch tome and saw things unfit for a sane mind. You burned the book, but its words and images are burned into your psyche.",
  "A fiend possessed you as a child. You were locked away but escaped. The fiend is still inside you, but now you try to keep it bottled up.",
  "You did terrible things to avenge the murder of someone you loved. You became a monster, and it haunts your waking dreams.",
  "Characteristics and Details",
  "Chaotic Evil",
  "Chaotic Good",
  "Chaotic Neutral",
  "Lawful Good",
  "Lawful Neutral",
  "Neutral",
  "Neutral Evil",
  "Neutral Good",
  "Lawful Evil creatures methodically take what they want within the limits of a code of tradition, loyalty, or order. An aristocrat exploiting citizens while scheming for power is probably Lawful Evil.",
  "Lifestyle",
  "Wretched",
  "Squalid (1SP)",
  "Poor (2SP)",
  "Modest (1GP)",
  "Comfortable (2GP)",
  "Wealthy (4GP)",
  "Aristocratic (10GP minimum)",
  "A modest lifestyle keeps you out of the slums and ensures that you can maintain your equipment. You live in an older part of town, renting a room in a boarding house, inn, or temple. You don't go hungry or thirsty, and your living conditions are clean, if simple. Ordinary people living modest lifestyles include soldiers with families, laborers, students, priests, hedge wizards, and the like.",
  "Weight (lbs)",
  "Age (Years)",
  "Suggestions",
  "What is your character like? How do their Ability Scores, like Wisdom or Charisma, contribute to their personality?",
  "Random",
  "I don’t run from evil. Evil runs from me.",
  "Add",
  "I like to read and memorize poetry. It keeps me calm and brings me fleeting moments of happiness.",
  "I spend money freely and live life to the fullest, knowing that tomorrow I might die.",
  "I live for the thrill of the hunt.",
  "I don’t talk about the thing that torments me. I’d rather not burden others with my curse.",
  "I expect danger around every corner.",
  "I refuse to become a victim, and I will not allow others to be victimized.",
  "I put no trust in divine beings.",
  "What are your character's vices or weaknesses? What do other people not like about them? What traits do they not like about themself? You can also consider their Ability Scores here.",
  "I have certain rituals that I must follow every day. I can never break them.",
  "I assume the worst in people.",
  "I feel no compassion for the dead. They’re the lucky ones.",
  "I have an addiction.",
  "I am a purveyor of doom and gloom who lives in a world without hope.",
  "I talk to spirits that no one else can see.",
  "Whom does your character care most about? To what place do they feel a special connection? What is their most treasured possession?",
  "I keep my thoughts and discoveries in a journal. My journal is my legacy.",
  "I would sacrifice my life and my soul to protect the innocent.",
  "My torment drove away the person I love. I strive to win back the love I’ve lost.",
  "A terrible guilt consumes me. I hope that I can find redemption through my actions.",
  "There’s evil in me, I can feel it. It must never be set free.",
  "I have a child to protect. I must make the world a safer place for him (or her).",
  "What drives and motivates your character? What values do they hold most important? What are they fighting for?",
  "I try to help those in need, no matter what the personal cost. (Good)",
  "I’ll stop the spirits that haunt me or die trying. (Any)",
  "I kill monsters to make the world a safer place, and to exorcise my own demons. (Good)",
  "I have a dark calling that puts me above the law. (Chaotic)",
  "I like to know my enemy’s capabilities and weaknesses before rushing into battle. (Lawful)",
  "I’m a monster that destroys other monsters, and anything else that gets in my way. (Evil)",
  "Orgs",
  "Allies",
  "Enemies",
  "Backstory",
  "Organizations",
  "Add Organizations",
  "Add Allies",
  "Add Enemies",
  "Add Backstory",
  "Add Other",
  "Manage Extras",
  "Extras that you add will display here.",
  "Player",
  "TaylorHo",
  "Change Sheet Appearance",
  "My Character",
  "Manage Character & Levels",
  "Manage Experience",
  "Character Settings",
  "Play",
  "Game Log",
  "Shareable Link",
  "Export to PDF"
]